# Starting with Pandas

## 0. Installation and Setup

`$ pip install pandas`

First, load import the library. 'pd' is an alias. You can use any name as an alias.

In [1]:
import pandas as pd
import numpy as np
pd.__version__ # Should output '0.24.2'

'0.24.2'

## 1. Creating DataFrames
A dictionary is used here where keys get converted to column names and values to row values.

In [2]:
data = pd.DataFrame({'Country': ['Russia','Colombia','Chile','Equador','Nigeria'],
                    'Rank':[121,40,100,130,11]})
data

    Country  Rank
0    Russia   121
1  Colombia    40
2     Chile   100
3   Equador   130
4   Nigeria    11

You can quickly generate descriptive statistics that summarize the dataset using .describe()

In [3]:
data.describe()

             Rank
count    5.000000
mean    80.400000
std     52.300096
min     11.000000
25%     40.000000
50%    100.000000
75%    121.000000
max    130.000000

.info() prints information of all columns:

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
Country    5 non-null object
Rank       5 non-null int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

## 2. Manipulating DataFrames
Let's start with another new DataFrame.

In [5]:
data = pd.DataFrame({'group':['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

### 2.1. Sorting DataFrames
Let's sort the data to be ascending by ounces. Setting `inplace = true` will change the actual order of the data in the DataFrame.

In [6]:
data.sort_values(by=['ounces'],ascending=True,inplace=False)

  group  ounces
1     a     3.0
6     c     3.0
0     a     4.0
7     c     5.0
3     b     6.0
8     c     6.0
4     b     7.5
5     b     8.0
2     a    12.0

We can also sort the data by multiple columns. The following code sorts groups alphabetically a-z, then sorts by ounces high-low.

In [7]:
data.sort_values(by=['group','ounces'],ascending=[True,False],inplace=False)

  group  ounces
2     a    12.0
0     a     4.0
1     a     3.0
5     b     8.0
4     b     7.5
3     b     6.0
8     c     6.0
7     c     5.0
6     c     3.0

### 2.2. Removing Duplicates
First, we'll create another new DataFrame with some duplicated rows.

In [8]:
data = pd.DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

To see the duplicates, we'll sort the values by the column 'k2'

In [9]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

We'll use `.drop_duplicates()` to remove any duplicate rows

In [10]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

Here, we removed duplicates based on matching row values across all columns. Alternatively, we can also remove duplicates based on a particular column by passing `subset = COLUMN_NAME` as a parameter. Let's remove duplicate values from the k1 column.

In [11]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

### 2.3. Categorizing, adding, and deleting data
Now we will learn to categorize rows based on criteria. For example, say we have a column with country names and we want to create a new variable 'continent' based on these country names. In such situations, we will require the steps below:

In [12]:
data = pd.DataFrame({'country': ['Canada', 'United States', 'France', 'Mexico','India', 'China', 'Egypt', 'Nigeria','Brazil'],
                 'population': [4, 6, 3, 7, 10, 8, 3, 5, 6]})
data

         country  population
0         Canada           4
1  United States           6
2         France           3
3         Mexico           7
4          India          10
5          China           8
6          Egypt           3
7        Nigeria           5
8         Brazil           6

Now, we want to create a new variable which indicates the continent in which the country lies. First we'll create a dictionary to map the food to the animals. Then, we'll use map function to map the dictionary's values to the keys. Let's see how is it done.

In [13]:
country_to_continent = {
'canada': 'North America',
'united states': 'North America',
'france': 'Europe',
'mexico': 'North America',
'india': 'Asia',
'china': 'Asia',
'egypt': 'Africa',
'nigeria': 'Africa',
'brazil': 'South America'
}

data['continent'] = data['country'].map(str.lower).map(country_to_continent)
data

         country  population      continent
0         Canada           4  North America
1  United States           6  North America
2         France           3         Europe
3         Mexico           7  North America
4          India          10           Asia
5          China           8           Asia
6          Egypt           3         Africa
7        Nigeria           5         Africa
8         Brazil           6  South America

We can create a new column/variable using the `assign` function.

In [14]:
data.assign(pop_thousand = data['population']*1000)

         country  population      continent  pop_thousand
0         Canada           4  North America          4000
1  United States           6  North America          6000
2         France           3         Europe          3000
3         Mexico           7  North America          7000
4          India          10           Asia         10000
5          China           8           Asia          8000
6          Egypt           3         Africa          3000
7        Nigeria           5         Africa          5000
8         Brazil           6  South America          6000

We can also remove columns using `drop`

In [15]:
data.drop('population',axis='columns',inplace=True)
data

         country      continent
0         Canada  North America
1  United States  North America
2         France         Europe
3         Mexico  North America
4          India           Asia
5          China           Asia
6          Egypt         Africa
7        Nigeria         Africa
8         Brazil  South America

### 2.4. Replacing Values
We'll start by creating another new DataFrame.

In [16]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

Using `replace`, we'll replace -999 with NaN values (NaN : Missing numerical data)

In [17]:
data.replace(-999, np.nan,inplace=True)
data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

We can also replace multiple values at once.

In [18]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data.replace([-999,-1000],np.nan,inplace=True)
data

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

### 2.5. Renaming
Again, we'll start with a new data set.

In [19]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

 We'll use the `rename` function (`index` represents row names and `columns` represents column names)

In [20]:
data.rename(index = {'Ohio':'SanF'}, columns={'one':'one_p','two':'two_p'},inplace=True)
data

          one_p  two_p  three  four
SanF          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

### 2.6. Categorizing into Bins
First, we'll make a list of ages, as well as a list of age group bins (such as 18-25, 26-35,36-60 and 60 and above).

In [21]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

We'll use `cut` to categorize the ages into the bins.

In [22]:
categories = pd.cut(ages, bins)
categories
#Output: '(' means the value is included the bin, '[' means the value is excluded

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

To include right bin value instead of left, use `right = False`

In [23]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

You can also use `.value_counts` to check the count in each bin.

In [24]:
pd.value_counts(categories)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

Now that you have the data sorted into bins, you can pass a name to each bin rather than using the numeric interval.

In [25]:
bin_names = ['Youth', 'YoungAdult', 'MiddleAge', 'Senior']
new_categories = pd.cut(ages, bins, labels=bin_names)
pd.value_counts(new_categories)

Youth         5
MiddleAge     3
YoungAdult    3
Senior        1
dtype: int64

`.cumsum()` gives the cumulative sum instead of the individual totals

In [26]:
pd.value_counts(new_categories).cumsum()

Youth          5
MiddleAge      8
YoungAdult    11
Senior        12
dtype: int64

### 2.7. Grouping Data and Pivot Tables

In [27]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5), 
                    # random.randn returns array of defined shape, filled with random floating-point samples from 
                    # the standard normal distribution rather than a uniform distribution.
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.326673  0.842847
1    a  two  0.117848  0.895297
2    b  one -0.314983 -0.759249
3    b  two -1.296012 -1.265487
4    a  one -0.637619  0.965552

You can calculate the mean of 'data1'  by 'key1'

In [28]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a   -0.615481
b   -0.805498
Name: data1, dtype: float64

Pivot tables are extremely useful in analyzing data using a customized tabular format.

In [29]:
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [30]:
#calculate means of each group
data.pivot_table(values='ounces',index='group',aggfunc=np.mean)

         ounces
group
a      6.333333
b      7.166667
c      4.666667

In [31]:
#count of each group
data.pivot_table(values='ounces',index='group',aggfunc='count')

       ounces
group
a           3
b           3
c           3

### 2.8. Creating a DataFrame by passing a NumPy array
We'll create a DataFrame with a datetime index and labeled columns.

In [32]:
dates = pd.date_range('20130101',periods=6)
print(dates)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-01-01  0.040953  0.822377 -0.374112  0.736452
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384
2013-01-03 -0.999464  1.103430  1.534561  1.243682
2013-01-04 -0.417476 -0.075299  0.622195  0.427463
2013-01-05 -0.176145  0.066293  1.500762  0.676811
2013-01-06  0.795178  1.198530  0.614106  0.610352

### 2.9. Ranges, Slices, and Cross Sections
Slice based on a date interval - inclusive on both ends

Grab the first 3 rows from the DataFrame.

In [33]:
df[:3]

                   A         B         C         D
2013-01-01  0.040953  0.822377 -0.374112  0.736452
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384
2013-01-03 -0.999464  1.103430  1.534561  1.243682

In [34]:
df['20130101':'20130104']

                   A         B         C         D
2013-01-01  0.040953  0.822377 -0.374112  0.736452
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384
2013-01-03 -0.999464  1.103430  1.534561  1.243682
2013-01-04 -0.417476 -0.075299  0.622195  0.427463

Get a cross section using a label.

In [35]:
df.loc[dates[0]]

A    0.040953
B    0.822377
C   -0.374112
D    0.736452
Name: 2013-01-01 00:00:00, dtype: float64

Slice by column

In [36]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.040953  0.822377
2013-01-02 -0.283805 -0.904795
2013-01-03 -0.999464  1.103430
2013-01-04 -0.417476 -0.075299
2013-01-05 -0.176145  0.066293
2013-01-06  0.795178  1.198530

Slice by row and column at the same time.

In [37]:
df.loc['20130102':'20130105', ['A', 'B']]

                   A         B
2013-01-02 -0.283805 -0.904795
2013-01-03 -0.999464  1.103430
2013-01-04 -0.417476 -0.075299
2013-01-05 -0.176145  0.066293

Slice based on an index of columns

In [38]:
df.iloc[3] #4th row

A   -0.417476
B   -0.075299
C    0.622195
D    0.427463
Name: 2013-01-04 00:00:00, dtype: float64

Slice by a range of rows and columns using index.

In [39]:
df.iloc[2:4, 1:3] #second value is exclusive when using indices

                   B         C
2013-01-03  1.103430  1.534561
2013-01-04 -0.075299  0.622195

We can also use `iloc` to return specific rows and columns using lists containing columns or row indexes.

In [40]:
df.iloc[[1,5],[0,2]]

                   A         C
2013-01-02 -0.283805 -0.597023
2013-01-06  0.795178  0.614106

Boolean indexing returns an array filled with the elements corresponding to the `True` values of the DataFrame.

In [41]:
df[df.A > -1]
#returns all rows where A value is greater than -1

                   A         B         C         D
2013-01-01  0.040953  0.822377 -0.374112  0.736452
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384
2013-01-03 -0.999464  1.103430  1.534561  1.243682
2013-01-04 -0.417476 -0.075299  0.622195  0.427463
2013-01-05 -0.176145  0.066293  1.500762  0.676811
2013-01-06  0.795178  1.198530  0.614106  0.610352

### 4. Miscellaneous Functions

In [42]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three'] #adding another column
df2

                   A         B         C         D      E
2013-01-01  0.040953  0.822377 -0.374112  0.736452    one
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384    one
2013-01-03 -0.999464  1.103430  1.534561  1.243682    two
2013-01-04 -0.417476 -0.075299  0.622195  0.427463  three
2013-01-05 -0.176145  0.066293  1.500762  0.676811   four
2013-01-06  0.795178  1.198530  0.614106  0.610352  three

Select rows based on values in particular column:

In [43]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.999464  1.103430  1.534561  1.243682   two
2013-01-05 -0.176145  0.066293  1.500762  0.676811  four

Select all except two and four

In [44]:
df2[~df2['E'].isin(['two', 'four'])]

                   A         B         C         D      E
2013-01-01  0.040953  0.822377 -0.374112  0.736452    one
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384    one
2013-01-04 -0.417476 -0.075299  0.622195  0.427463  three
2013-01-06  0.795178  1.198530  0.614106  0.610352  three

List all rows where A is greater than C.

In [45]:
df.query('A > C')

                   A         B         C         D
2013-01-01  0.040953  0.822377 -0.374112  0.736452
2013-01-02 -0.283805 -0.904795 -0.597023  0.553384
2013-01-06  0.795178  1.198530  0.614106  0.610352

Use `|` for the OR condition

In [46]:
df.query('A < B | C > A')

                   A         B         C         D
2013-01-01  0.040953  0.822377 -0.374112  0.736452
2013-01-03 -0.999464  1.103430  1.534561  1.243682
2013-01-04 -0.417476 -0.075299  0.622195  0.427463
2013-01-05 -0.176145  0.066293  1.500762  0.676811
2013-01-06  0.795178  1.198530  0.614106  0.610352

## 5. More Resources & Further Learning

[Complete Official Pandas Documentation](https://pandas.pydata.org/pandas-docs/version/0.15/index.html#)

[Python Pandas Tutorial: A Complete Introduction for Beginners](https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/)